app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if(params[:artist_id] && !Artist.exists?(params[:artist_id]))

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
      @artist_id = params[:artist_id]
    if(params[:artist_id])
        if @artist = Artist.find_by(id: params[:artist_id])
            @song = @artist.songs.find_by(id: params[:id])